"use strict";
let result = 10 + 10 + "10";
console.log(result);
result = 10 + "10" + 10;
console.log(result);
result = 10 + 10 + +"10";
console.log(result);
result = 10 / - "";
console.log(result);
result = 10 / + "2,5";
console.log(result);
/*
1. 10 прибавляем 10 и прибавляем "10" получаем 2010 - конкатенация с результатом сложения двух чисел (действия выполняются слева на право)
2. 10 прибавляем "10" и прибавляем 10 получаем 101010 - конкатенация всех трех значений
3. 10 прибавляем 10 и прибавляем +"10" получаем 30 - сложение трех чисел тк перед строкой "10" стоит унарный плюс что преобразует строку в число
4. 10 делим на -"" получаем -Infinity - деление числа на -0 получаем -бесконечность
5. 10 делим на +"2,5" получаем NaN - вычисления некорректны так происходит деление на строку "2,5"(в десятичных числах следует указавть точку в качестве разделителя) 
*/