'use strict';
let mode = "normal"; // Название переменной корректно.
let my_valu3 = 102; // Название переменной корректно. Использование нижнего почеркивания разрешено в любой части названия переменной
let 3my_value3 = "102"; // Название переменной некоректно. Так как запрещено использовать цифру в начале названия переменной
let __hello__ = "world"; // Название переменной корректно. Использование нижнего почеркивания разрешено в любой части названия переменной
let $$$ = "money"; // Название переменной корректно. Использование знака доллара разрешено в любой части названия переменной
let !0_world = true; // Название переменной некоректно . Восклицательный знак является зарезервированым системой, а цифру запрещено использовать в начале названия переменной